CREATE DATABASE  IF NOT EXISTS `b308` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `b308`;
-- MySQL dump 10.13  Distrib 8.0.28, for Win64 (x86_64)
--
-- Host: J7B308.p.ssafy.io    Database: b308
-- ------------------------------------------------------
-- Server version	8.0.30-0ubuntu0.20.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `si`
--

DROP TABLE IF EXISTS `si`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `si` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `do_id` bigint DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FKamdhon3qhnk6iqmv8fnukyr7k` (`do_id`),
  CONSTRAINT `FKamdhon3qhnk6iqmv8fnukyr7k` FOREIGN KEY (`do_id`) REFERENCES `do` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=251 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `si`
--

LOCK TABLES `si` WRITE;
/*!40000 ALTER TABLE `si` DISABLE KEYS */;
INSERT INTO `si` VALUES (1,'강남구',1),(2,'강동구',1),(3,'강북구',1),(4,'강서구',1),(5,'관악구',1),(6,'광진구',1),(7,'구로구',1),(8,'금천구',1),(9,'노원구',1),(10,'도봉구',1),(11,'동대문구',1),(12,'동작구',1),(13,'마포구',1),(14,'서대문구',1),(15,'서초구',1),(16,'성동구',1),(17,'성북구',1),(18,'송파구',1),(19,'양천구',1),(20,'영등포구',1),(21,'용산구',1),(22,'은평구',1),(23,'종로구',1),(24,'중구',1),(25,'중랑구',1),(26,'강서구',2),(27,'금정구',2),(28,'기장군',2),(29,'남구',2),(30,'동구',2),(31,'동래구',2),(32,'부산진구',2),(33,'북구',2),(34,'사상구',2),(35,'사하구',2),(36,'서구',2),(37,'수영구',2),(38,'연제구',2),(39,'영도구',2),(40,'중구',2),(41,'해운대구',2),(42,'남구',3),(43,'달서구',3),(44,'달성군',3),(45,'동구',3),(46,'북구',3),(47,'서구',3),(48,'수성구',3),(49,'중구',3),(50,'강화군',4),(51,'계양구',4),(52,'남동구',4),(53,'동구',4),(54,'미추홀구',4),(55,'부평구',4),(56,'서구',4),(57,'연수구',4),(58,'옹진군',4),(59,'중구',4),(60,'광산구',5),(61,'남구',5),(62,'동구',5),(63,'북구',5),(64,'서구',5),(65,'대덕구',6),(66,'동구',6),(67,'서구',6),(68,'유성구',6),(69,'중구',6),(70,'남구',7),(71,'동구',7),(72,'북구',7),(73,'울주군',7),(74,'중구',7),(75,'세종특별자치시',8),(76,'가평군',9),(77,'고양시 덕양구',9),(78,'고양시 일산동구',9),(79,'고양시 일산서구',9),(80,'과천시',9),(81,'광명시',9),(82,'광주시',9),(83,'구리시',9),(84,'군포시',9),(85,'김포시',9),(86,'남양주시',9),(87,'동두천시',9),(88,'부천시',9),(89,'성남시 분당구',9),(90,'성남시 수정구',9),(91,'성남시 중원구',9),(92,'수원시 권선구',9),(93,'수원시 영통구',9),(94,'수원시 장안구',9),(95,'수원시 팔달구',9),(96,'시흥시',9),(97,'안산시 단원구',9),(98,'안산시 상록구',9),(99,'안성시',9),(100,'안양시 동안구',9),(101,'안양시 만안구',9),(102,'양주시',9),(103,'양평군',9),(104,'여주시',9),(105,'연천군',9),(106,'오산시',9),(107,'용인시 기흥구',9),(108,'용인시 수지구',9),(109,'용인시 처인구',9),(110,'의왕시',9),(111,'의정부시',9),(112,'이천시',9),(113,'파주시',9),(114,'평택시',9),(115,'포천시',9),(116,'하남시',9),(117,'화성시',9),(118,'강릉시',10),(119,'고성군',10),(120,'동해시',10),(121,'삼척시',10),(122,'속초시',10),(123,'양구군',10),(124,'양양군',10),(125,'영월군',10),(126,'원주시',10),(127,'인제군',10),(128,'정선군',10),(129,'철원군',10),(130,'춘천시',10),(131,'태백시',10),(132,'평창군',10),(133,'홍천군',10),(134,'화천군',10),(135,'횡성군',10),(136,'괴산군',11),(137,'단양군',11),(138,'보은군',11),(139,'영동군',11),(140,'옥천군',11),(141,'음성군',11),(142,'제천시',11),(143,'증평군',11),(144,'진천군',11),(145,'청주시 상당구',11),(146,'청주시 서원구',11),(147,'청주시 청원구',11),(148,'청주시 흥덕구',11),(149,'충주시',11),(150,'계룡시',12),(151,'공주시',12),(152,'금산군',12),(153,'논산시',12),(154,'당진시',12),(155,'보령시',12),(156,'부여군',12),(157,'서산시',12),(158,'서천군',12),(159,'아산시',12),(160,'예산군',12),(161,'천안시 동남구',12),(162,'천안시 서북구',12),(163,'청양군',12),(164,'태안군',12),(165,'홍성군',12),(166,'고창군',13),(167,'군산시',13),(168,'김제시',13),(169,'남원시',13),(170,'무주군',13),(171,'부안군',13),(172,'순창군',13),(173,'완주군',13),(174,'익산시',13),(175,'임실군',13),(176,'장수군',13),(177,'전주시 덕진구',13),(178,'전주시 완산구',13),(179,'정읍시',13),(180,'진안군',13),(181,'강진군',14),(182,'고흥군',14),(183,'곡성군',14),(184,'광양시',14),(185,'구례군',14),(186,'나주시',14),(187,'담양군',14),(188,'목포시',14),(189,'무안군',14),(190,'보성군',14),(191,'순천시',14),(192,'신안군',14),(193,'여수시',14),(194,'영광군',14),(195,'영암군',14),(196,'완도군',14),(197,'장성군',14),(198,'장흥군',14),(199,'진도군',14),(200,'함평군',14),(201,'해남군',14),(202,'화순군',14),(203,'경산시',15),(204,'경주시',15),(205,'고령군',15),(206,'구미시',15),(207,'군위군',15),(208,'김천시',15),(209,'문경시',15),(210,'봉화군',15),(211,'상주시',15),(212,'성주군',15),(213,'안동시',15),(214,'영덕군',15),(215,'영양군',15),(216,'영주시',15),(217,'영천시',15),(218,'예천군',15),(219,'울릉군',15),(220,'울진군',15),(221,'의성군',15),(222,'청도군',15),(223,'청송군',15),(224,'칠곡군',15),(225,'포항시 남구',15),(226,'포항시 북구',15),(227,'거제시',16),(228,'거창군',16),(229,'고성군',16),(230,'김해시',16),(231,'남해군',16),(232,'밀양시',16),(233,'사천시',16),(234,'산청군',16),(235,'양산시',16),(236,'의령군',16),(237,'진주시',16),(238,'창녕군',16),(239,'창원시 마산합포구',16),(240,'창원시 마산회원구',16),(241,'창원시 성산구',16),(242,'창원시 의창구',16),(243,'창원시 진해구',16),(244,'통영시',16),(245,'하동군',16),(246,'함안군',16),(247,'함양군',16),(248,'합천군',16),(249,'서귀포시',17),(250,'제주시',17);
/*!40000 ALTER TABLE `si` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-10-07  9:55:38
